from pyecharts.faker import Faker
from pyecharts import options as opts
from pyecharts.charts import Map

# 注： map.add()函数中的maptype参数指明地图类型
# 具体参考 pyecharts.datasets.map_filenames.json 文件


## 用于绘图的数据，随机生成：
prov_list = [('广东省', 44993),('江苏省',47498) ,('山东省',35705),('内蒙古自治区',34108),
             ('北京市', 75002), ('上海市', 78027),('天津市',47449),('福建省',40659),('西藏自治区',24950),
             ('江西省', 30610), ('湖南省', 31993), ('浙江省', 57541),('湖南省',31993),('辽宁省',35112),
             ('重庆市',33803),('安徽省',30904),('四川省',29080),('陕西省',28568),('云南省',25666),
             ('河北省',29383),('海南省',30457),('湖北省',30829),('贵州省',23996),('广西壮族自治区',26727),
             ('青海省',25919),('新疆省',26075),('山西省',27426),('宁夏回族自治区',27904),
             ('河南省',26811),('甘肃省',22066),('黑龙江省',27159),('吉林省',27770),('新疆维吾尔自治区',26075)]

## 在中国地图上绘制上述数据，即填充对应省份的区域
c = (
    Map()
    .add("单位：/元",
         prov_list,
         maptype="china",
    )
    .set_global_opts(
        title_opts=opts.TitleOpts(title="全国大陆省市2021年收入水平"),
        visualmap_opts=opts.VisualMapOpts(max_=78027,min_=22066),  # 此项配置渐变色的最大数值
    )
)

c.render('./output/income_visual_prov.html')
